{
    "narratives": {
        "malicious_domain": "DOMINIO MALICIOSO DETECTADO: {{proc}} se est치 conectando a \"{{domain}}\", un dominio clasificado como PELIGROSO. Motivos: {{reasons}}. Esto es un indicador muy fuerte de compromiso o malware.",
        "crypto_mining": "POSIBLE MINER칈A DE CRIPTOMONEDAS: {{proc}} est치 conectado a un puerto t칤picamente usado para miner칤a (Stratum). Si a esto le sumas que {{signature}} y {{resources}}, es muy probable que sea un minero no deseado (Cryptojacking).",
        "tor_traffic": "TR츼FICO ANONIMIZADO (TOR): {{proc}} est치 enviando tr치fico a trav칠s de la red Tor. Esto es altamente sospechoso para un proceso normal, ya que el malware utiliza Tor para ocultar la ubicaci칩n de sus servidores de control (C2). A menos que est칠s usando un navegador Tor expl칤citamente, deber칤as investigar esto.",
        "beacon_behavior": "COMPORTAMIENTO DE \"LLAMADA A CASA\": {{proc}} est치 realizando conexiones repetitivas a intervalos regulares (Beaconing) y no tiene una firma digital v치lida. Este es el comportamiento cl치sico de un malware esperando instrucciones de su creador. Se recomienda terminar el proceso inmediatamente.",
        "suspicious_domain": "DOMINIO SOSPECHOSO: {{proc}} conecta a \"{{domain}}\", que presenta caracter칤sticas inusuales ({{reasons}}). Aunque no es definitivamente malicioso, justifica una revisi칩n.",
        "tmp_execution": "EJECUCI칍N SOSPECHOSA: {{proc}} se est치 ejecutando desde una carpeta temporal del sistema. Los instaladores leg칤timos hacen esto a veces, pero tambi칠n es el lugar favorito de los \"droppers\" de malware para esconderse antes de infectar el sistema permanentemente.",
        "high_resources": "ALTO CONSUMO DE RECURSOS: {{proc}} est치 estresando tu sistema (CPU o RAM alta). {{context}}",
        "unsigned_internet": "CONEXI칍N NO VERIFICADA: Una aplicaci칩n sin firma digital ({{proc}}) se ha conectado a Internet. macOS no puede verificar qui칠n cre칩 este programa. Si no lo instalaste t칰 mismo recientemente, ten cuidado.",
        "mining_tor": "MINER칈A OCULTA (CR칈TICO): {{proc}} no solo parece estar minando criptomonedas, sino que intenta ocultar su tr치fico usando la red Tor. Esto es un indicador definitivo de malware sofisticado intentando monetizar tu equipo sin ser detectado.",
        "c2_beacon": "COMUNICACI칍N C2 CONFIRMADA: {{proc}} est치 realizando 'llamadas a casa' (beaconing) hacia un dominio conocido por ser MALICIOSO. El atacante tiene control activo sobre este proceso.",
        "dropper_behavior": "COMPORTAMIENTO DE DROPPER: Un proceso sin firma digital ejecut치ndose desde una carpeta temporal ({{path}}). Esta es la t칠cnica est치ndar para infectar un sistema: descargar un archivo temporal, ejecutarlo y luego instalar el malware real.",
        "unsigned_tor": "MALWARE AN칍NIMO: Un proceso desconocido (sin firma) utilizando la red Tor. No hay ninguna raz칩n leg칤tima para que una aplicaci칩n no firmada necesite anonimato de grado militar, excepto para ocultar actividades delictivas.",
        "system_process": "PROCESO DEL SISTEMA: {{proc}} es un componente verificado de macOS. Es normal que tenga actividad de red para actualizaciones o servicios de iCloud.",
        "verified_app": "APLICACI칍N VERIFICADA: {{proc}} cuenta con una firma digital v치lida de un desarrollador registrado. Se est치 conectando a {{type}}, lo cual es normal para aplicaciones que buscan actualizaciones o sincronizan datos.",
        "generic": "El proceso {{proc}} (PID {{pid}}) ha establecido una conexi칩n de red. Analiza la evidencia t칠cnica m치s abajo para determinar si es leg칤timo.",
        "apple_context": "Al ser un proceso de Apple, podr칤a ser una indexaci칩n o actualizaci칩n de fondo.",
        "third_party_context": "Al ser una app de terceros, podr칤a estar colgada o realizando una tarea intensiva en segundo plano.",
        "no_signature": "no tiene firma digital",
        "third_party": "es una app de terceros",
        "consuming_resources": "est치 consumiendo muchos recursos",
        "maintains_connection": "mantiene la conexi칩n activa",
        "evidence": {
            "tmp": {
                "title": "Ejecutable en Carpeta Temporal",
                "desc": "El proceso se est치 ejecutando desde una carpeta temporal (/tmp, /var/tmp). Esto es muy com칰n en malware (droppers) o scripts maliciosos que intentan ocultarse, aunque tambi칠n lo hacen algunos instaladores leg칤timos."
            },
            "sensitive": {
                "title": "Puerto Sensible",
                "desc": "El proceso est치 usando un puerto conocido de administraci칩n (como SSH, RDP, Telnet). Si no iniciaste esta conexi칩n expl칤citamente, podr칤a ser un intento de acceso remoto no autorizado."
            },
            "mining": {
                "title": "Miner칤a de Criptomonedas",
                "desc": "El puerto utilizado es caracter칤stico de protocolos de miner칤a (Stratum, etc.). Es muy probable que este proceso est칠 usando tu hardware para minar criptomonedas sin tu permiso (Cryptojacking)."
            },
            "tor": {
                "title": "Red Tor",
                "desc": "Conexi칩n a la red Tor. Esto anonimiza el tr치fico. El malware suele usarlo para comunicarse con sus servidores de control (C2) sin ser rastreado."
            },
            "public_ip": {
                "title": "IP P칰blica",
                "desc": "El proceso est치 conectado directamente a Internet, no a un dispositivo de tu red local. Verifica si este programa deber칤a tener acceso a la red externa."
            },
            "recent": {
                "title": "Ejecutable Reciente",
                "desc": "El archivo ejecutable fue creado o modificado hace menos de 3 d칤as. El malware nuevo suele tener fechas muy recientes."
            },
            "beacon": {
                "title": "Comportamiento Beacon",
                "desc": "Se han detectado conexiones repetitivas a intervalos regulares (como un latido). Este es el comportamiento t칤pico de un malware 'llamando a casa' para recibir instrucciones."
            },
            "unsigned": {
                "title": "Sin Firma Digital",
                "desc": "El sistema operativo no puede verificar el autor de este programa. Apple no lo ha notariado. Ejecutar c칩digo sin firmar conlleva riesgos."
            },
            "apple": {
                "title": "Firmado por Apple",
                "desc": "Este es un proceso del sistema operativo o una aplicaci칩n firmada oficialmente por Apple. Generalmente es seguro."
            },
            "quarantine": {
                "title": "En Cuarentena",
                "desc": "Este archivo tiene la marca de cuarentena (com.apple.quarantine), lo que significa que fue descargado de Internet y a칰n no ha sido verificado completamente por el usuario."
            },
            "abuse": {
                "title": "IP Reportada (AbuseIPDB)",
                "desc": "La direcci칩n IP de destino ha sido reportada m칰ltiples veces como maliciosa en bases de datos de inteligencia de amenazas."
            },
            "many_dsts": {
                "title": "M칰ltiples Destinos",
                "desc": "El proceso est치 conectando a muchos servidores diferentes simult치neamente. Podr칤a ser P2P (Torrent), pero tambi칠n un comportamiento de escaneo de red o exfiltraci칩n de datos."
            },
            "high_cpu": {
                "title": "Alto Consumo de CPU",
                "desc": "El proceso est치 usando m치s del 50% de tu procesador. Si no est치s haciendo tareas pesadas, podr칤a ser miner칤a oculta o un proceso colgado."
            },
            "high_ram": {
                "title": "Alto Consumo de RAM",
                "desc": "El proceso est치 consumiendo m치s de 500MB de memoria RAM. Podr칤a indicar una fuga de memoria o una aplicaci칩n muy pesada."
            },
            "parent": {
                "title": "Spawn Sospechoso",
                "desc": "Este proceso fue lanzado por bash/curl/sh/python u otro int칠rprete de comandos, y est치 conectando a Internet. Este es un patr칩n muy com칰n en ataques tipo 'curl | bash' donde se descarga y ejecuta malware directamente desde un sitio web malicioso."
            },
            "dns_risk": {
                "title": "Riesgo DNS Detectado",
                "desc": "El dominio al que se conecta este proceso tiene indicadores de riesgo como DGA (Domain Generation Algorithm), keywords sospechosas, TLD riesgoso, o alta entrop칤a. Esto sugiere que el dominio podr칤a ser malicioso o estar asociado con malware."
            },
            "risky_country": {
                "title": "Pa칤s de Alto Riesgo",
                "desc": "La conexi칩n se dirige a un pa칤s frecuentemente asociado con ciberataques, censura o actividad maliciosa. Esto no significa autom치ticamente que la conexi칩n sea maliciosa, pero requiere atenci칩n adicional."
            },
            "closed": {
                "title": "Conexi칩n Cerrada",
                "desc": "Esta conexi칩n ya fue cerrada pero se mantiene en el historial para revisi칩n. Puedes encontrarla en la pesta침a 'History'."
            },
            "ransomware": {
                "title": "游뚿 POSIBLE RANSOMWARE",
                "desc": "Este proceso muestra comportamiento t칤pico de ransomware: alta velocidad de escritura en disco (cifrado de archivos) combinada con alto uso de CPU. Esto puede indicar que el proceso est치 cifrando archivos r치pidamente. Si no reconoces este programa, term칤nalo INMEDIATAMENTE."
            }
        }
    }
}